package ru.naumen.collection.task1;

import java.util.HashMap;

/**
 * Дано:
 * <pre>
 * public class Ticket {
 *     private long id;
 *     private String client;
 *     …
 * }</pre>
 * <p>Разработать программу для бармена в холле огромного концертного зала.
 * Зрители в кассе покупают билет (класс Ticket), на котором указан идентификатор билета (id) и имя зрителя.
 * При этом, есть возможность докупить наборы разных товаров (комбо-обед): нет товаров, напитки, еда и напитки.
 * Доп. услуги оформляются через интернет и привязываются к билету, но хранятся отдельно от билета
 * (нельзя добавить товары в класс Ticket).</p>
 * <p>Бармен сканирует билет и получает объект Ticket. По этому объекту нужно уметь
 * находить необходимые товары по номеру билета. И делать это нужно очень быстро,
 * ведь нужно как можно быстрее всех накормить.</p>
 * <p>
 * См. {@link Ticket}
 *
 * @author vpyzhyanov
 * @since 19.10.2023
 */
public class Task1
{
//  Изначальная сложность поиска в HashMap равна const + O(1) в случае, когда
//  коллизия отсутствует. Но при большом объеме данных сложность поиска будет стремиться
//  к O(n) из-за огромного количества коллизий по хешу.
    private final HashMap<Long, Goods> information  = new HashMap<>();
    public enum Goods {
        /**
         * нет товаров
         */
        EMPTY,
        /**
         * напитки
         */
        DRINKS,
        /**
         * еда и напитки
         */
        FOOD_AND_DRINKS
    }
    /**
     * Получить товары по билету
     */
    public Goods getGoods(Ticket ticket) {
        // В задании сказано, что бармен должен осуществлять быстрый поиск по номеру билета.
        Goods goods = information.get(ticket.getId());
        //Если товара нет в HashMap, то возвращаем Goods.EMPTY
        return goods != null ? goods : Goods.EMPTY;
    }
}
